hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_ethernetif.c
/*
 * Copyright 2025, Cypress Semiconductor Corporation (an Infineon company) or
 * an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
 *
 * This software, including source code, documentation and related
 * materials ("Software") is owned by Cypress Semiconductor Corporation
 * or one of its affiliates ("Cypress") and is protected by and subject to
 * worldwide patent protection (United States and foreign),
 * United States copyright laws and international treaty provisions.
 * Therefore, you may use this Software only as provided in the license
 * agreement accompanying the software package from which you
 * obtained this Software ("EULA").
 * If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
 * non-transferable license to copy, modify, and compile the Software
 * source code solely for use in connection with Cypress's
 * integrated circuit products.  Any reproduction, modification, translation,
 * compilation, or representation of this Software except as specified
 * above is prohibited without the express written permission of Cypress.
 *
 * Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
 * EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
 * reserves the right to make changes to the Software without notice. Cypress
 * does not assume any liability arising out of the application or use of the
 * Software or any product or circuit described in the Software. Cypress does
 * not authorize its products for use in any products where a malfunction or
 * failure of the Cypress product may reasonably be expected to result in
 * significant property damage, injury or death ("High Risk Product"). By
 * including Cypress's product in a High Risk Product, the manufacturer
 * of such system or application assumes all risk of such use and in doing
 * so agrees to indemnify Cypress against all liability.
*/

#if defined(CYBSP_ETHERNET_CAPABLE)

#include <string.h>
#include <stdint.h>
#include "lwipopts.h"
#include "lwip/netif.h"
#include "lwip/netifapi.h"
#include "lwip/init.h"
#include "lwip/dhcp.h"
#include "lwip/etharp.h"
#include "lwip/tcpip.h"
#include "lwip/ethip6.h"
#include "lwip/igmp.h"
#include "lwip/nd6.h"
#include "netif/ethernet.h"
#include "lwip/prot/autoip.h"
#include "lwip/prot/dhcp.h"
#include "lwip/dns.h"
#include "lwip/inet_chksum.h"

#include "lwip/icmp.h"
#include "lwip/inet.h"
#include "lwip/netdb.h"
#if NO_SYS
#include "lwip/timeouts.h"
#endif

#include "cy_lwip_dhcp_server.h"
#include "cy_network_mw_core.h"
#include "cy_result.h"
#include "cy_lwip_log.h"

#if defined(CY_XMC4XXX_DEVICES)
#include "cycfg.h"
#include "xmc_gpio.h"
#include "xmc_eth_mac.h"
#include "xmc_eth_phy.h"
#include "cy_eth_config.h"
#if !NO_SYS
#include "cyabs_rtos.h"
#endif
#endif

#if !defined(CY_XMC4XXX_DEVICES)
#include "cy_ecm.h"
#include "cy_internal.h"
#endif

#include "cy_lwip_internal.h"

/******************************************************
 *                      Macros
 ******************************************************/
/**
 * Suppress unused parameter warning
 */
#define UNUSED_PARAMETER(x) ( (void)(x) )

#define CY_ETHERNET_LINK_STATUS_POLL_INTERVAL_MS (1000U)

/**
 * Suppress unused variable warning
 */
#define UNUSED_VARIABLE(x) ( (void)(x) )

#define EAPOL_PACKET_TYPE                        0x888E

#define MULTICAST_IP_TO_MAC(ip)                  {   (uint8_t) 0x01,             \
                                                     (uint8_t) 0x00,             \
                                                     (uint8_t) 0x5e,             \
                                                     (uint8_t) ((ip)[1] & 0x7F), \
                                                     (uint8_t) (ip)[2],          \
                                                     (uint8_t) (ip)[3]           \
                                                 }
#define IPV6_MULTICAST_TO_MAC_PREFIX             (0x33)

#define MAX_AUTO_IP_RETRIES                      (5)

#define MAX_ETHERNET_PORT                        (2U)
#define ETH_INTERFACE_INDEX                      (2U)
#define MAX_ETH_FRAME_SIZE                       (1500U)

/* Define those to better describe your network interface. */
#define IFNAME0                                  'e'
#define IFNAME1                                  'n'

#define ETH_MIN_FRAME_SIZE                      (64)
#define ETH_MAX_FRAME_SIZE                      (1518)
#define ETH_FRAME_SIZE_FCS                      (4) // (This is constant value)
#define ETH_FRAME_SIZE_HEADER                   (14) // 6 bytes for destination address, 6 bytes for source address, 2 bytes for Type (This is constant.)

#ifdef CY_XMC4XXX_DEVICES
#if !defined(eth_0_mux_0_PHY_ADDR)
#error "Enable Ethernet(ETH) peripheral from device configurator to resolve build errors."
#endif

#define ETH_LWIP_0_PHY_ADDR                      eth_0_mux_0_PHY_ADDR

#define ETH_LWIP_0_NUM_RX_BUF                    eth_0_mux_0_MTL_NUM_RX_BUF //(4U)
#define ETH_LWIP_0_NUM_TX_BUF                    eth_0_mux_0_MTL_NUM_TX_BUF //(4U)

/*Maximum retry iterations for phy auto-negotiation*/
#define ETH_LWIP_PHY_MAX_RETRIES                 0xfffffU

#define CY_ETH_SIZE_MAX_FRAME                   (1500)

#ifdef ENABLE_ECM_LOGS
    #define RX_STATUS_THREAD_STACK_SIZE         ((1024 * 1) + (1024 * 3)) /* Additional 3kb of stack is added for enabling the prints */
#else
    #define RX_STATUS_THREAD_STACK_SIZE         (1024)
#endif
#if defined CYCFG_ETHERNET_THREAD_STACKSIZE
#define RX_EVENT_THREAD_STACK_SIZE              (CYCFG_ETHERNET_THREAD_STACKSIZE)
#else
#define RX_EVENT_THREAD_STACK_SIZE              (1024 * 4)
#endif

#if defined CYCFG_ETHERNET_THREAD_PRIO
#define RX_EVENT_THREAD_PRIORITY                (CYCFG_ETHERNET_THREAD_PRIO)
#else
#define RX_EVENT_THREAD_PRIORITY                (CY_RTOS_PRIORITY_ABOVENORMAL)
#endif

#define RX_STATUS_THREAD_PRIORITY               (CY_RTOS_PRIORITY_BELOWNORMAL)
#endif

#if !defined(CY_XMC4XXX_DEVICES)
#define TX_DATA_BUF_MAX                         CY_ETH_DEFINE_TOTAL_BD_PER_TXQUEUE
#define TX_SEMAPHORE_TIMEOUT_MS                 120000
#endif
/******************************************************
 *               Variable Definitions
 ******************************************************/
#if !defined(CY_XMC4XXX_DEVICES)
/* PDL Driver requires the data to be 32 byte aligned */
#ifdef COMPONENT_PSE84
#if (CY_CPU_CORTEX_M55)
CY_SECTION(".cy_gpu_buf")
#elif (CY_CPU_CORTEX_M33)
CY_SECTION(".cy_shared_socmem")
#endif
#else /* !COMPONENT_PSE84 */
CY_SECTION_SHAREDMEM
#endif
CY_ALIGN(32)
static   uint8_t                              data_buffer[TX_DATA_BUF_MAX][CY_ETH_SIZE_MAX_FRAME];
volatile uint8_t                              tx_free_buf_index;
static   uint8_t                              tx_buf_available;
extern   cy_semaphore_t                       tx_semaphore;
extern   cy_mutex_t                           tx_mutex;
extern   cy_worker_thread_info_t              cy_tx_worker_thread;
static   cy_network_activity_event_callback_t activity_callback = NULL;
extern   cy_network_interface_context         iface_context_database[CY_IFACE_MAX_HANDLE];
extern   cy_worker_thread_info_t              cy_rx_worker_thread;
extern   cy_queue_t                           rx_input_buffer_queue;
LWIP_MEMPOOL_DECLARE(RX_POOL, ETH_RX_NO_OF_MEMPOOL_ELEMENTS, sizeof(my_custom_pbuf_t), "Zero-copy RX PBUF pool");
#endif

#ifdef CY_XMC4XXX_DEVICES
#if !NO_SYS
static cy_semaphore_t           rx_semaphore = NULL;
static cy_thread_t              rx_event_thread = NULL;
static cy_thread_t              link_status_thread = NULL;
#endif /* NO_SYS */

#if defined(__ICCARM__)
#pragma data_alignment=4
static XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF];
#pragma data_alignment=4
static XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF];
#pragma data_alignment=4
static uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE];
#pragma data_alignment=4
static uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE];
#elif defined(__CC_ARM)
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF] __attribute__((section ("RW_IRAM1")));
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF] __attribute__((section ("RW_IRAM1")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("RW_IRAM1")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("RW_IRAM1")));
#elif defined(__GNUC__)
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF] __attribute__((section ("ETH_RAM")));
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF] __attribute__((section ("ETH_RAM")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("ETH_RAM")));
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE] __attribute__((section ("ETH_RAM")));
#else
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_rx_desc[ETH_LWIP_0_NUM_RX_BUF];
static __attribute__((aligned(4))) XMC_ETH_MAC_DMA_DESC_t ETH_LWIP_0_tx_desc[ETH_LWIP_0_NUM_TX_BUF];
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_rx_buf[ETH_LWIP_0_NUM_RX_BUF][XMC_ETH_MAC_BUF_SIZE];
static __attribute__((aligned(4))) uint8_t ETH_LWIP_0_tx_buf[ETH_LWIP_0_NUM_TX_BUF][XMC_ETH_MAC_BUF_SIZE];
#endif

const XMC_ETH_PHY_CONFIG_t eth_phy_config =
{
    .interface = (XMC_ETH_LINK_INTERFACE_t)eth_0_mux_0_PHY_INTERCONNECT,
#if (defined(eth_0_mux_0_AUTONEGOTIATION) && (eth_0_mux_0_AUTONEGOTIATION == 1u))
    .enable_auto_negotiate = true
#else
    .enable_auto_negotiate = false,
    .duplex = eth_0_mux_0_PHY_MODE,
    .speed = eth_0_mux_0_PHY_SPEED
#endif
};

XMC_ETH_MAC_t eth_mac =
{
    .regs = ETH0,
    .address = eth_0_mux_0_MAC_ADDR,
    .rx_desc = ETH_LWIP_0_rx_desc,
    .tx_desc = ETH_LWIP_0_tx_desc,
    .rx_buf = &ETH_LWIP_0_rx_buf[0][0],
    .tx_buf = &ETH_LWIP_0_tx_buf[0][0],
    .num_rx_buf = ETH_LWIP_0_NUM_RX_BUF,
    .num_tx_buf = ETH_LWIP_0_NUM_TX_BUF
};

