hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_ethernetif.c
static struct netif *xnetif = NULL;
#endif
/******************************************************
 *               Static Function Declarations
 ******************************************************/
#if !defined(CY_XMC4XXX_DEVICES)
void cy_process_ethernet_data_cb(ETH_Type *eth_type, uint8_t * rx_buffer, uint32_t length);
void cy_notify_ethernet_rx_data_cb(ETH_Type *base, uint8_t **u8RxBuffer, uint32_t *u32Length);
void cy_tx_complete_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex );
void cy_tx_failure_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex );
#endif

static err_t ethif_output(struct netif *netif, struct pbuf *p);
err_t ethernetif_init(struct netif *netif);

#if defined(CY_XMC4XXX_DEVICES)
static void low_level_init(struct netif *netif);
static struct pbuf * low_level_input(void);
static void ethernetif_input(void *arg);

#if LWIP_NETIF_LINK_CALLBACK == 1
static void ethernetif_link_callback(struct netif *netif);
static void ethernetif_link_status(void *args);
#endif
#endif
/******************************************************
 *               Function Definitions
 ******************************************************/
#if defined(CY_XMC4XXX_DEVICES)
/*Weak function to be called in case of error*/
__WEAK void ETH_LWIP_Error (ETH_LWIP_ERROR_t error_code)
{
    switch (error_code)
    {
        case ETH_LWIP_ERROR_PHY_DEVICE_ID:
        {
            /* Incorrect PHY address configured in the ETH_LWIP APP network interface.
            * Because the connect PHY does not match the configuration or the PHYADR is incorrect*/
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "%s(): Wrong PHY ID used \n", __FUNCTION__ );
            break;
        }

        case ETH_LWIP_ERROR_PHY_TIMEOUT:
        {
            /* PHY did not respond.*/
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "%s(): PHY read failed \n", __FUNCTION__ );
            break;
        }

        case ETH_LWIP_ERROR_PHY_ERROR:
        {
            /*PHY register update failed.*/
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "%s(): PHY status error \n", __FUNCTION__ );
            break;
        }

        case ETH_LWIP_ERROR_PHY_BUSY:
        {
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "%s(): PHY is busy \n", __FUNCTION__ );
            break;
        }
        default:
        {
            cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_ERR, "%s(): Generic PHY error \n", __FUNCTION__ );
            break;
        }
    }
    return;
}

#if LWIP_NETIF_LINK_CALLBACK == 1
static void ethernetif_link_callback(struct netif *netif)
{
    static uint8_t is_phy_configured = false;
    int32_t status;

    if (netif_is_link_up(netif))
    {
        if (!is_phy_configured)
        {
            if((status = XMC_ETH_PHY_Init(&eth_mac, ETH_LWIP_0_PHY_ADDR, &eth_phy_config)) != XMC_ETH_PHY_STATUS_OK)
            {
                ETH_LWIP_Error((ETH_LWIP_ERROR_t)status);
            }
#if (defined(eth_0_mux_0_AUTONEGOTIATION) && (eth_0_mux_0_AUTONEGOTIATION == 1u))
            XMC_ETH_LINK_SPEED_t speed;
            XMC_ETH_LINK_DUPLEX_t duplex;
            uint32_t retries = 0U;
            bool phy_autoneg_state = false;

            /* If autonegotiation is enabled */
            do {
                phy_autoneg_state = XMC_ETH_PHY_IsAutonegotiationCompleted(&eth_mac, ETH_LWIP_0_PHY_ADDR);
                retries++;
            } while ((phy_autoneg_state == false) && (retries < ETH_LWIP_PHY_MAX_RETRIES));

            if(phy_autoneg_state == false)
            {
                ETH_LWIP_Error(ETH_LWIP_ERROR_PHY_TIMEOUT);
            }

            speed = XMC_ETH_PHY_GetLinkSpeed(&eth_mac, ETH_LWIP_0_PHY_ADDR);
            duplex = XMC_ETH_PHY_GetLinkDuplex(&eth_mac, ETH_LWIP_0_PHY_ADDR);

            XMC_ETH_MAC_SetLink(&eth_mac, speed, duplex);
#else
            XMC_ETH_MAC_SetLink(&eth_mac, eth_0_mux_0_PHY_SPEED, eth_0_mux_0_PHY_MODE);
#endif
        }
        is_phy_configured = true;

#if (defined(eth_0_mux_0_RXD_POLLING_EN) && (eth_0_mux_0_RXD_POLLING_EN == 0u))
        /* Enable Ethernet interrupts */
        XMC_ETH_MAC_EnableEvent(&eth_mac, (uint32_t)XMC_ETH_MAC_EVENT_RECEIVE);

        NVIC_SetPriority((IRQn_Type)108, NVIC_EncodePriority(NVIC_GetPriorityGrouping(), 62U, 0U));
        NVIC_ClearPendingIRQ((IRQn_Type)108);
        NVIC_EnableIRQ((IRQn_Type)108);
#endif
        XMC_ETH_MAC_EnableTx(&eth_mac);
        XMC_ETH_MAC_EnableRx(&eth_mac);

        CY_LWIP_NETIF_API_VOID_RET(netif_set_up(xnetif));
    }
    else
    {
        /* Disable Ethernet interrupts */
        XMC_ETH_MAC_DisableEvent(&eth_mac, (uint32_t)XMC_ETH_MAC_EVENT_RECEIVE);
        NVIC_DisableIRQ((IRQn_Type)108);

        XMC_ETH_MAC_DisableTx(&eth_mac);
        XMC_ETH_MAC_DisableRx(&eth_mac);

        CY_LWIP_NETIF_API_VOID_RET(netif_set_down(xnetif));
    }
}
#endif

static void ethernetif_link_status(void *args)
{
    UNUSED_PARAMETER(args);

#if !NO_SYS
    while(1)
#endif
    {
        if (XMC_ETH_PHY_GetLinkStatus(&eth_mac, ETH_LWIP_0_PHY_ADDR) == XMC_ETH_LINK_STATUS_DOWN)
        {
            if (netif_is_link_up(xnetif))
            {
                netif_set_link_down(xnetif);
            }
        }
        else
        {
             if (!netif_is_link_up(xnetif))
            {
                netif_set_link_up(xnetif);
            }
        }
#if !NO_SYS
        cy_rtos_delay_milliseconds( CY_ETHERNET_LINK_STATUS_POLL_INTERVAL_MS );
#else
        sys_timeout(CY_ETHERNET_LINK_STATUS_POLL_INTERVAL_MS, ethernetif_link_status, NULL);
#endif
    }

}

/**
 * In this function, the hardware should be initialized.
 * Called from ethernetif_init().
 *
 * @param netif Already initialized lwIP network interface structure
 *        for this ethernetif
 */
static void low_level_init(struct netif *netif)
{
    UNUSED_PARAMETER(netif);

    XMC_ETH_MAC_PORT_CTRL_t port_control;

#if (defined(eth_0_mux_0_PHY_INTERCONNECT) && (eth_0_mux_0_PHY_INTERCONNECT == XMC_ETH_LINK_INTERFACE_MII))
    port_control.mode = XMC_ETH_MAC_PORT_CTRL_MODE_MII;
    port_control.rxd2 = ETH0_MII_RXD2;
    port_control.rxd3 = ETH0_MII_RXD3;
    port_control.clk_rmii = ETH0_MII_CLKRX;
    port_control.crs_dv = ETH0_MII_RXDV;
    port_control.crs = ETH0_MII_CRS;
    port_control.col = ETH0_MII_COL;
    port_control.clk_tx = ETH0_MII_CLK_TX;
#else
    port_control.mode = XMC_ETH_MAC_PORT_CTRL_MODE_RMII;
    port_control.clk_rmii = ETH0_RMII_CLK_RMII;
    port_control.crs_dv = ETH0_RMII_CRS_DV;
#endif
    port_control.rxd0 = ETH0_PHY_RXD0;
    port_control.rxd1 = ETH0_PHY_RXD1;
    port_control.rxer = ETH0_PHY_RX_ERR;
    port_control.mdio = ETH0_SMA_MDI;
    XMC_ETH_MAC_SetPortControl(&eth_mac, port_control);

