hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_ethernetif.c
    (void)XMC_ETH_MAC_Init(&eth_mac);

    XMC_ETH_MAC_DisableJumboFrame(&eth_mac);

#if (defined(eth_0_mux_0_BROADCAST_EN) && (eth_0_mux_0_BROADCAST_EN == 1u))
    XMC_ETH_MAC_EnableReceptionBroadcastFrames(&eth_mac);
#else
    XMC_ETH_MAC_DisableReceptionBroadcastFrames(&eth_mac);
#endif

#if (defined(eth_0_mux_0_PROMISCUOUS_EN) && (eth_0_mux_0_PROMISCUOUS_EN == 1u))
    XMC_ETH_MAC_EnablePromiscuousMode(&eth_mac);
#else
    XMC_ETH_MAC_DisablePromiscuousMode(&eth_mac);
#endif
}
#endif

#if !defined(CY_XMC4XXX_DEVICES)
#if LWIP_IPV4 && LWIP_IGMP
/*
 * This function is used to respond to IGMP (group management) requests.
 */
static err_t igmp_eth_filter(struct netif *iface, const ip4_addr_t *group, enum netif_mac_filter_action action)
{
    cy_stc_ethif_filter_config_t filter_config;
    uint8_t mac_addr[CY_MAC_ADDR_LEN] = MULTICAST_IP_TO_MAC((uint8_t*)group);

    filter_config.typeFilter = CY_ETHIF_FILTER_TYPE_DESTINATION;
    filter_config.filterAddr.byte[0] = mac_addr[0];
    filter_config.filterAddr.byte[1] = mac_addr[1];
    filter_config.filterAddr.byte[2] = mac_addr[2];
    filter_config.filterAddr.byte[3] = mac_addr[3];
    filter_config.filterAddr.byte[4] = mac_addr[4];
    filter_config.filterAddr.byte[5] = mac_addr[5];
    filter_config.ignoreBytes        = 0x00;

    cy_network_interface_context *if_ctx;
    if_ctx = (cy_network_interface_context *)iface->state;

    switch ( action )
    {
        case NETIF_ADD_MAC_FILTER:
#if (CY_IP_MXETH_INSTANCES > 1u)
            if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH1)
            {
                if (Cy_ETHIF_SetFilterAddress(ETH1, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
                {
                    return ERR_VAL;
                }
            }
            else if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH0)
            {
                if (Cy_ETHIF_SetFilterAddress(ETH0, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
                {
                    return ERR_VAL;
                }
            }
#else
            if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH0)
            {
                if (Cy_ETHIF_SetFilterAddress(ETH0, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
                {
                    return ERR_VAL;
                }
            }
#endif
            break;

        case NETIF_DEL_MAC_FILTER:
            memset((void *)&(filter_config.filterAddr.byte[0]), 0, CY_MAC_ADDR_LEN);
#if (CY_IP_MXETH_INSTANCES > 1u)
            if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH1)
            {
                if (Cy_ETHIF_SetFilterAddress(ETH1, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
                {
                    return ERR_VAL;
                }
            }
            else if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH0)
            {
                if (Cy_ETHIF_SetFilterAddress(ETH0, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
                {
                    return ERR_VAL;
                }
            }

#else
            if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH0)
            {
                if (Cy_ETHIF_SetFilterAddress(ETH0, CY_ETHIF_FILTER_NUM_1, &filter_config) != CY_ETHIF_SUCCESS)
                {
                    return ERR_VAL;
                }
            }
#endif
            break;

        default:
            return ERR_VAL;
    }

    return ERR_OK;
}
#endif

void custom_pbuf_free_cb(struct pbuf* p)
{
    cy_rslt_t result = CY_RSLT_SUCCESS;

    if(p == NULL)
    {
        return;
    }

    my_custom_pbuf_t* my_pbuf = (my_custom_pbuf_t*)p;
    result = cy_rtos_put_queue(&rx_input_buffer_queue, &my_pbuf->pbuffer, CY_RTOS_NEVER_TIMEOUT, false);
    if (CY_RSLT_SUCCESS != result)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Failed to push the free buffer to queue:[%d]\n", result);
    }

    LWIP_MEMPOOL_FREE(RX_POOL, my_pbuf);
}

static void rx_data_event_handler(void* arg)
{
    uint8_t *buffer = (uint8_t *)arg;
    cy_rx_buffer_info_t *rx_buffer_info;

    struct netif *netif = NULL;
    uint8_t i = 0;

    rx_buffer_info = (cy_rx_buffer_info_t *)buffer;
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Rx Buffer address from pool rx_buffer_info->rx_data_ptr:[%p] rx_buffer_info->length:[%d] rx_buffer_info->eth_idx:[%d]\n", rx_buffer_info->rx_data_ptr, rx_buffer_info->length, rx_buffer_info->eth_idx );

    for (i = 0; i < CY_IFACE_MAX_HANDLE; i++)
    {
        if( ( iface_context_database[i].is_initialized == true ) &&
            ( iface_context_database[i].iface_type == CY_NETWORK_ETH_INTERFACE ) &&
            ( iface_context_database[i].iface_idx == rx_buffer_info->eth_idx ) )
        {
            netif = (struct netif *)iface_context_database[i].nw_interface;
            break;
        }
    }

    if( i == CY_IFACE_MAX_HANDLE )
    {
        cy_rtos_put_queue(&rx_input_buffer_queue, &rx_buffer_info, CY_RTOS_NEVER_TIMEOUT, false);
        return;
    }

    my_custom_pbuf_t* my_pbuf  = (my_custom_pbuf_t*)LWIP_MEMPOOL_ALLOC(RX_POOL);
    if(my_pbuf == NULL)
    {
        cy_rtos_put_queue(&rx_input_buffer_queue, &rx_buffer_info, CY_RTOS_NEVER_TIMEOUT, false);
        return;
    }

    my_pbuf->pbuf_custom.custom_free_function = custom_pbuf_free_cb;
    my_pbuf->pbuffer = rx_buffer_info;

    struct pbuf* p = pbuf_alloced_custom(PBUF_RAW, rx_buffer_info->length,
                                         PBUF_REF,
                                         &my_pbuf->pbuf_custom,
                                         rx_buffer_info->rx_data_ptr,
                                         CY_ETH_SIZE_MAX_FRAME); /* Length size = payload + header size */

    if (p != NULL)
    {

        /* Call activity handler which is registered with the argument as false
        * indicating that there is RX packet.
        */
        if (activity_callback)
        {
            activity_callback(false);
        }

#ifdef ENABLE_CONNECTIVITY_MIDDLEWARE_LOGS
        size_t num_waiting;
        cy_rtos_count_queue(&rx_input_buffer_queue, &num_waiting);
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_DEBUG, "the number of items currently in the queue:[%d]\n", num_waiting);
#endif

