hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_ethernetif.c
        /* Invalidate dcache if enabled to update dcache's contents after DMA transfer */
#if !defined (CY_DISABLE_XMC7000_DATA_CACHE) && defined (__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
        SCB_InvalidateDCache_by_Addr((void *) rx_buffer_info->rx_data_ptr, rx_buffer_info->length);
#endif

        /* Call netif->input */
        /* If the interface is not yet set up, drop the packet here. */
        if (netif->input == NULL || netif->input(p, netif) != ERR_OK)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "Drop packet before lwip \n");
            (void)pbuf_free(p);
        }
    }
    else
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "rx_data_event_handler: pbuf allocation failed\n");
        cy_rtos_put_queue(&rx_input_buffer_queue, &rx_buffer_info, CY_RTOS_NEVER_TIMEOUT, false);
    }
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
}

void cy_process_ethernet_data_cb( ETH_Type *eth_type, uint8_t *rx_buffer, uint32_t length )
{
    cy_rx_buffer_info_t *rx_params;
    ETH_Type *base_reg = eth_type;

    if (!((length >= CY_ETH_SIZE_MIN_FRAME) && (length <= CY_ETH_SIZE_MAX_FRAME)))
    {
        /* Ethernet packet received with invalid Rx length */
        cy_rtos_put_queue(&rx_input_buffer_queue, rx_buffer, CY_RTOS_NEVER_TIMEOUT, true);
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "Invalid Ethernet frame size. Push the rx_buffer back to the rx pool\n");
        return;
    }

    rx_params = (cy_rx_buffer_info_t *)(rx_buffer - sizeof(cy_rx_buffer_info_t));
    rx_params->rx_data_ptr = rx_buffer;
#if (CY_IP_MXETH_INSTANCES > 1u)
    if(base_reg == ETH1)
    {
        rx_params->eth_idx = 1;
    }
    else if(base_reg == ETH0)
    {
        rx_params->eth_idx = 0;
    }
#else
    if(base_reg == ETH0)
    {
        rx_params->eth_idx = 0;
    }
#endif
    rx_params->length = length;

    if((cy_worker_thread_enqueue(&cy_rx_worker_thread, rx_data_event_handler, (void *)rx_params)) != CY_RSLT_SUCCESS)
    {
        /* ERROR : Failed to send Rx callback notification. */
        /* TODO: The rx_buffer to be freed? */
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_worker_thread_enqueue Failed\n");
        return;
    }
}

void cy_notify_ethernet_rx_data_cb(ETH_Type *base, uint8_t **u8RxBuffer, uint32_t *u32Length)
{
    uint8_t *pbuffer = NULL;
    cy_rx_buffer_info_t *params;

    if(cy_rtos_get_queue(&rx_input_buffer_queue, (void *)&pbuffer, CY_RTOS_NEVER_TIMEOUT, true) != CY_RSLT_SUCCESS)
    {
        /* Failed to get a free buffer from the queue. */
        *u8RxBuffer = NULL;
        *u32Length = 0;
        return;
    }

    params = (cy_rx_buffer_info_t *)pbuffer;
    params->rx_data_ptr = (uint8_t *)(pbuffer + sizeof(cy_rx_buffer_info_t));
    *u32Length = CY_ETH_SIZE_MAX_FRAME;
    *u8RxBuffer = params->rx_data_ptr;
    return;
}

static void tx_event_handler(void* arg)
{
    cy_rslt_t result;

    result = cy_rtos_get_mutex( &tx_mutex , CY_RTOS_NEVER_TIMEOUT);
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_rtos_get_mutex failed\n");
        return;
    }
    if(tx_buf_available == 0)
    {
        tx_buf_available++;
        cy_rtos_set_semaphore( &tx_semaphore, 1 );
    }
    else
    {
        tx_buf_available++;
    }
    result = cy_rtos_set_mutex( &tx_mutex );
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "cy_rtos_set_mutex failed\n");
        return;
    }
}
void cy_tx_complete_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex )
{
    (void)pstcEth;
    (void)u8QueueIndex;

    /* Push the tx event into the worker queue */
    if((cy_worker_thread_enqueue(&cy_tx_worker_thread, tx_event_handler, NULL)) != CY_RSLT_SUCCESS)
    {
        return;
    }
}

void cy_tx_failure_cb ( ETH_Type *pstcEth, uint8_t u8QueueIndex )
{
    (void)pstcEth;
    (void)u8QueueIndex;

    /* Push the tx event into the worker queue */
    if((cy_worker_thread_enqueue(&cy_tx_worker_thread, tx_event_handler, NULL)) != CY_RSLT_SUCCESS)
    {
        return;
    }
}

#endif
/**
 * This function should do the actual transmission of the packet. The packet is
 * contained in the pbuf that is passed to the function. This pbuf
 * might be chained.
 *
 * @param netif The lwIP network interface structure for this ethernetif
 * @param p The MAC packet to send (e.g., IP packet including the MAC addresses and type)
 * @return ERR_OK if the packet could be sent;
 *         an err_t value if the packet couldn't be sent.
 *
 * @note Returning ERR_MEM here if a DMA queue of your MAC is full, which can lead to
 *       unexpected results. Consider waiting for space in the DMA queue
 *       to become available because the stack doesn't retry to send a packet
 *       dropped because of memory failure (except for the TCP timers).
 */
static err_t ethif_output(struct netif *netif, struct pbuf *p)
{
    struct pbuf *q;

#if !NO_SYS
    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): START \n", __FUNCTION__ );
#endif

#ifdef CY_XMC4XXX_DEVICES
    XMC_UNUSED_ARG(netif);
    uint8_t *buf;
    uint32_t framelen = 0U;

    if (p->tot_len > (u16_t)XMC_ETH_MAC_BUF_SIZE)
    {
        return ERR_BUF;
    }

    if (XMC_ETH_MAC_IsTxDescriptorOwnedByDma(&eth_mac))
    {
        XMC_ETH_MAC_ResumeTx(&eth_mac);
        return ERR_BUF;
    }
    else
    {
        buf = XMC_ETH_MAC_GetTxBuffer(&eth_mac);

#if ETH_PAD_SIZE
        pbuf_header(p, -ETH_PAD_SIZE);    /* Drop the padding word. */
#endif

        for(q = p; q != NULL; q = q->next)
        {
            /* Send the data from the pbuf to the interface, one pbuf at a
            time. The size of the data in each pbuf is kept in the ->len
            variable. */
            MEMCPY(buf, q->payload, q->len);
            framelen += (uint32_t)q->len;
            buf += q->len;
        }

#if ETH_PAD_SIZE
        pbuf_header(p, ETH_PAD_SIZE);    /* Reclaim the padding word. */
#endif


        XMC_ETH_MAC_SetTxBufferSize(&eth_mac, framelen);

