hydevcode/sdk-bsp-psoc_e84-edgi-talk/projects/Edgi_Talk_M55_XiaoZhi/packages/wifi-host-driver-latest/lwip-network-interface-integration/source/cy_ethernetif.c
        XMC_ETH_MAC_ReturnTxDescriptor(&eth_mac);
        XMC_ETH_MAC_ResumeTx(&eth_mac);

        return ERR_OK;
    }
#endif

#if !defined(CY_XMC4XXX_DEVICES)
    cy_network_interface_context *if_ctx;
    cy_en_ethif_status_t eth_status;
    uint32_t framelen=0;
    cy_rslt_t result;

    if_ctx = (cy_network_interface_context *)netif->state;

    if (p->tot_len > (u16_t)CY_ETH_SIZE_MAX_FRAME)
    {
      return ERR_BUF;
    }

    /* Call activity handler which is registered with the argument as true
     * indicating there is TX packet.
     */
    if (activity_callback)
    {
        activity_callback(true);
    }

#if ETH_PAD_SIZE
    pbuf_header(p, -ETH_PAD_SIZE);    /* Drop the padding word. */
#endif

    if(tx_buf_available == 0)
    {
        result = cy_rtos_get_semaphore( &tx_semaphore, TX_SEMAPHORE_TIMEOUT_MS, false );
        if(result != CY_RSLT_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_get_semaphore failed\n");
            return ERR_TIMEOUT;
        }
    }
    for(q = p; q != NULL; q = q->next)
    {
        MEMCPY((data_buffer[tx_free_buf_index] + framelen), q->payload, q->len);
        framelen += (uint32_t)q->len;
    }

#if ETH_PAD_SIZE
    pbuf_header(p, ETH_PAD_SIZE);    /* Reclaim the padding word. */
#endif

#if !defined (CY_DISABLE_XMC7000_DATA_CACHE) && defined (__DCACHE_PRESENT) && (__DCACHE_PRESENT == 1U)
    SCB_CleanDCache_by_Addr((void*)data_buffer[tx_free_buf_index], framelen);
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Before Start transmitting frame p->tot_len:[%d] p->len:[%d] \n", __FUNCTION__, p->tot_len, p->len );
#if (CY_IP_MXETH_INSTANCES > 1u)
    if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH1)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Start transmitting frame ETH1 \n", __FUNCTION__ );
        eth_status = Cy_ETHIF_TransmitFrame(ETH1, (uint8_t*)data_buffer[tx_free_buf_index], framelen, CY_ETH_QS0_0, true);

        if(eth_status != CY_ETHIF_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to send outgoing packet :[%d]\n", eth_status);
        }
    }
    else
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Start transmitting frame ETH0 \n", __FUNCTION__ );
        eth_status = Cy_ETHIF_TransmitFrame(ETH0, (uint8_t*)data_buffer[tx_free_buf_index], framelen, CY_ETH_QS0_0, true);
        if(eth_status != CY_ETHIF_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to send outgoing packet :[%d]\n", eth_status);
        }
    }
#else
    if(if_ctx->iface_idx == (uint8_t)CY_ECM_INTERFACE_ETH0)
    {
        cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): Start transmitting frame ETH0 \n", __FUNCTION__ );
        eth_status = Cy_ETHIF_TransmitFrame(ETH0, (uint8_t*)data_buffer[tx_free_buf_index], framelen, CY_ETH_QS0_0, true);
        if(eth_status != CY_ETHIF_SUCCESS)
        {
            cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "failed to send outgoing packet :[%d]\n", eth_status);
        }
    }

#endif
    result = cy_rtos_get_mutex( &tx_mutex , CY_RTOS_NEVER_TIMEOUT);
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_get_mutex failed\n");
        return ERR_IF;
    }
    /* Next data_buffer index to be used
     * Note: Tx completion callback is synchronous.
     */
    tx_free_buf_index = (tx_free_buf_index + 1) % TX_DATA_BUF_MAX;
    tx_buf_available--;
    result = cy_rtos_set_mutex( &tx_mutex );
    if(result != CY_RSLT_SUCCESS)
    {
        cm_cy_log_msg(CYLF_MIDDLEWARE, CY_LOG_ERR, "cy_rtos_set_mutex failed\n");
    }
#endif

    cm_cy_log_msg( CYLF_MIDDLEWARE, CY_LOG_DEBUG, "%s(): END \n", __FUNCTION__ );
    return ERR_OK ;
}

#ifdef CY_XMC4XXX_DEVICES
/**
 * Should allocate a pbuf and transfer the bytes of the incoming
 * packet from the interface into the pbuf.
 *
 * @param netif The lwIP network interface structure for this ethernetif
 * @return A pbuf filled with the received packet (including MAC header);
 *         NULL on memory error
 */
static struct pbuf * low_level_input(void)
{

    struct pbuf *p = NULL;
    struct pbuf *q;
    uint32_t len;
    uint8_t *buffer;

    if (XMC_ETH_MAC_IsRxDescriptorOwnedByDma(&eth_mac) == false)
    {
        len = XMC_ETH_MAC_GetRxFrameSize(&eth_mac);

        if ((len > 0U) && (len <= (uint32_t)XMC_ETH_MAC_BUF_SIZE))
        {
#if ETH_PAD_SIZE
            len += ETH_PAD_SIZE;    /* Allow room for Ethernet padding. */
#endif

            /* Allocate a pbuf chain of pbufs from the pool. */
            p = pbuf_alloc(PBUF_RAW, (u16_t)len, PBUF_POOL);

            if (p != NULL)
            {
#if ETH_PAD_SIZE
                pbuf_header(p, -ETH_PAD_SIZE);  /* Drop the padding word. */
#endif

                buffer = XMC_ETH_MAC_GetRxBuffer(&eth_mac);

                len = 0U;
                /* Iterate over the pbuf chain until the entire
                 * packet is read into the pbuf. */
                for (q = p; q != NULL; q = q->next)
                {
                /* Read enough bytes to fill this pbuf in the chain. The
                 * available data in the pbuf is given by the q->len
                 * variable.
                 * This does not necessarily have to be a memcpy; you can also preallocate
                 * pbufs for a DMA-enabled MAC and after receiving truncate it to the
                 * actually received size. In this case, ensure the tot_len member of the
                 * pbuf is the sum of the chained pbuf len members.
                 */
                     MEMCPY(q->payload, &buffer[len], q->len);
                     len += q->len;
                }
#if ETH_PAD_SIZE
                pbuf_header(p, ETH_PAD_SIZE);    /* Reclaim the padding word. */
#endif

                XMC_ETH_MAC_ReturnRxDescriptor(&eth_mac);
            }
        }
        else
        {
            XMC_ETH_MAC_ReturnRxDescriptor(&eth_mac);
        }
    }

